
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-HOST
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
* Delete
  * azurerm_key_vault_secret.POSTGRES-HOST-V15
  * azurerm_key_vault_secret.POSTGRES-PASS-V15
  * azurerm_key_vault_secret.POSTGRES-USER-V15


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-HOST will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-HOST" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat"
      + name                    = "translation-service-POSTGRES-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-HOST-V15 will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-HOST-V15 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-HOST-V15" {
      - id                      = "https://ts-aat.vault.azure.net/secrets/translation-service-POSTGRES-HOST-V15/b189770ea3ef409fb870f6ea04205f0d" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat" -> null
      - name                    = "translation-service-POSTGRES-HOST-V15" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat/secrets/translation-service-POSTGRES-HOST-V15/versions/b189770ea3ef409fb870f6ea04205f0d" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat/secrets/translation-service-POSTGRES-HOST-V15" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "b189770ea3ef409fb870f6ea04205f0d" -> null
      - versionless_id          = "https://ts-aat.vault.azure.net/secrets/translation-service-POSTGRES-HOST-V15" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-PASS will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat"
      + name                    = "translation-service-POSTGRES-PASS"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-PASS-V15 will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-PASS-V15 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-PASS-V15" {
      - content_type            = "" -> null
      - id                      = "https://ts-aat.vault.azure.net/secrets/translation-service-POSTGRES-PASS-V15/c891824ea4f649a980a665aff524c86b" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat" -> null
      - name                    = "translation-service-POSTGRES-PASS-V15" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat/secrets/translation-service-POSTGRES-PASS-V15/versions/c891824ea4f649a980a665aff524c86b" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat/secrets/translation-service-POSTGRES-PASS-V15" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "c891824ea4f649a980a665aff524c86b" -> null
      - versionless_id          = "https://ts-aat.vault.azure.net/secrets/translation-service-POSTGRES-PASS-V15" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat"
      + name                    = "translation-service-POSTGRES-USER"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER-V15 will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-USER-V15 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-USER-V15" {
      - id                      = "https://ts-aat.vault.azure.net/secrets/translation-service-POSTGRES-USER-V15/e617c1ce902745f68fca585a9e24a8af" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat" -> null
      - name                    = "translation-service-POSTGRES-USER-V15" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat/secrets/translation-service-POSTGRES-USER-V15/versions/e617c1ce902745f68fca585a9e24a8af" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ts-shared-aat/providers/Microsoft.KeyVault/vaults/ts-aat/secrets/translation-service-POSTGRES-USER-V15" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "e617c1ce902745f68fca585a9e24a8af" -> null
      - versionless_id          = "https://ts-aat.vault.azure.net/secrets/translation-service-POSTGRES-USER-V15" -> null
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":276,"Program":"tfcmt","SHA1":"","Vars":{}} -->